import requests
import json

PROVINCES = {
    1 : "Қорақолпоғистон Республикаси",
    2 : "Андижон вилояти",
    3 : "Бухоро вилояти",
    4 : "Жиззах вилояти",
    5 : "Қашқадарё вилояти",
    6 : "Навоий вилояти",
    7 : "Наманган вилояти",
    8 : "Самарқанд вилояти",
    9 : "Сурхондарё вилояти",
    10 : "Сирдарё вилояти",
    11 : "Тошкент вилояти",
    12 : "Фарғона вилояти",
    13 : "Хоразм вилояти",
    14 : "Тошкент шахар"
}
DISTRICTS = {
    1 : [{"id":2301,"nomi":"Амударё","reja":6000},{"id":2301,"nomi":"Амударё","reja":6000},{"id":2302,"nomi":"Беруний","reja":5000},{"id":2303,"nomi":"Бўзатов","reja":250},{"id":2304,"nomi":"Кегейли ","reja":3500},{"id":2313,"nomi":"Қонликўл","reja":4000},{"id":2314,"nomi":"Қораўзак","reja":3450},{"id":2315,"nomi":"Қўнғирот","reja":2950},{"id":2305,"nomi":"Мўйноқ","reja":250},{"id":2306,"nomi":"Нукус т.","reja":5800},{"id":2318,"nomi":"Тахиатош","reja":900},{"id":2307,"nomi":"Тахтакўпир","reja":2800},{"id":2308,"nomi":"Тўрткўл","reja":5000},{"id":2309,"nomi":"Хўжайли","reja":2650},{"id":2310,"nomi":"Чимбой","reja":3450},{"id":2311,"nomi":"Шўманой","reja":3000},{"id":2312,"nomi":"Элликқалъа","reja":4000}],
    2 : [
    { "id": 1701, "nomi": 'Андижон',    "reja": 3865 },
    { "id": 1702, "nomi": 'Асака',      "reja": 4160 },
    { "id": 1703, "nomi": 'Баликчи',    "reja": 6966 },
    { "id": 1704, "nomi": 'Булокбоши',  "reja": 2925 },
    { "id": 1705, "nomi": 'Бўстон',     "reja": 4915 },
    { "id": 1706, "nomi": 'Жалакудук',  "reja": 7060 },
    { "id": 1707, "nomi": 'Избоскан',   "reja": 6265 },
    { "id": 1714, "nomi": 'Кўргонтепа', "reja": 8790 },
    { "id": 1708, "nomi": 'Мархамат',   "reja": 5700 },
    { "id": 1709, "nomi": 'Олтинкўл',   "reja": 4210 },
    { "id": 1710, "nomi": 'Пахтаобод',  "reja": 6870 },
    { "id": 1711, "nomi": 'Улуғнор',    "reja": 5225 },
    { "id": 1712, "nomi": 'Хўжаобод',   "reja": 2274 },
    { "id": 1713, "nomi": 'Шахрихон',   "reja": 6775 },
],
    3 : [{"id":2005,"nomi":"Олот","reja":5006},{"id":2001,"nomi":"Бухоро","reja":5092},{"id":2002,"nomi":"Вобкент","reja":6210},{"id":2011,"nomi":"Ғиждувон","reja":4891},{"id":2004,"nomi":"Когон","reja":4206},{"id":2010,"nomi":"Қоракўл","reja":5626},{"id":2009,"nomi":"Қоровулбозор","reja":5525},{"id":2006,"nomi":"Пешку","reja":5046},{"id":2007,"nomi":"Ромитан","reja":5980},{"id":2003,"nomi":"Жондор","reja":6714},{"id":2008,"nomi":"Шофиркон","reja":6154}],
    4 : [{"id":1306,"nomi":"Зарбдор","reja":16300},{"id":1307,"nomi":"Зафаробод","reja":10000},{"id":1308,"nomi":"Зомин","reja":4500},{"id":1310,"nomi":"Пахтакор","reja":13000},{"id":1312,"nomi":"Янгиобод","reja":0},{"id":1309,"nomi":"Мирзачўл","reja":13700},{"id":1301,"nomi":"Арнасой","reja":10000},{"id":1305,"nomi":"Дўстлик","reja":13700},{"id":1311,"nomi":"Фориш","reja":0},{"id":1304,"nomi":"Ш.Рашидов","reja":12300},{"id":1302,"nomi":"Бахмал","reja":0},{"id":1303,"nomi":"Fаллаорол","reja":0},{"id":1313,"nomi":"Жиззах.ш","reja":0}],
    5 : [{"id":1814,"nomi":"Ғузор","reja":8450},{"id":1802,"nomi":"Деҳқонобод","reja":0},{"id":1803,"nomi":"Касби","reja":13900},{"id":1804,"nomi":"Китоб","reja":2000},{"id":1805,"nomi":"Косон","reja":17500},{"id":1812,"nomi":"Қамаши","reja":10000},{"id":1813,"nomi":"Қарши","reja":13700},{"id":1815,"nomi":"Қарши.ш","reja":0},{"id":1801,"nomi":"Миришкор","reja":21750},{"id":1806,"nomi":"Муборак","reja":8750},{"id":1807,"nomi":"Нишон","reja":18000},{"id":1809,"nomi":"Чироқчи","reja":8600},{"id":1810,"nomi":"Шахрисабз","reja":6250},{"id":1810,"nomi":"Шахрисабз.ш","reja":100},{"id":1811,"nomi":"Яккабоғ","reja":8000}],
    6 : [{"id":2101,"nomi":"Конимех","reja":1785},{"id":2108,"nomi":"Қизилтепа","reja":10224},{"id":2102,"nomi":"Навбахор","reja":8682},{"id":2103,"nomi":"Кармана","reja":6120},{"id":2104,"nomi":"Нурота","reja":0},{"id":2107,"nomi":"Хатирчи","reja":11228},{"id":2109,"nomi":"Навоий ш","reja":0},{"id":2110,"nomi":"Зарафшон ш","reja":0},{"id":2111,"nomi":"Ғазғон ш","reja":0}],
    7 : [{"id":1714204,"nomi":"Мингбулоқ","reja":9085},{"id":1714207,"nomi":"Косонсой","reja":6170},{"id":1714212,"nomi":"Наманган","reja":5170},{"id":1714216,"nomi":"Норин","reja":4570},{"id":1714219,"nomi":"Поп","reja":10490},{"id":1714224,"nomi":"Тўрақўрғон","reja":4880},{"id":1714229,"nomi":"Уйчи","reja":6425},{"id":1714234,"nomi":"Учқўрғон","reja":6890},{"id":1714236,"nomi":"Чортоқ","reja":1870},{"id":1714237,"nomi":"Чуст","reja":10050},{"id":1714242,"nomi":"Янгиқўрғон","reja":2150},{"id":1714401,"nomi":"Наманган ш.","reja":0}],
    8 : [{"id":1408,"nomi":"Окдарё","reja":9610},{"id":1401,"nomi":"Булунғур","reja":6290},{"id":1402,"nomi":"Жомбой","reja":8735},{"id":1403,"nomi":"Иштихон","reja":7380},{"id":1405,"nomi":"Каттақўрғон","reja":8926},{"id":1404,"nomi":"Нарпай","reja":5720},{"id":1406,"nomi":"Нарпай","reja":5720},{"id":1409,"nomi":"Нуробод","reja":2010},{"id":1410,"nomi":"Пастдарғом","reja":17466},{"id":1411,"nomi":"Пахтачи","reja":6254},{"id":1412,"nomi":"Пайариқ","reja":12289},{"id":1407,"nomi":"Қўшработ","reja":0},{"id":1414,"nomi":"Ургут","reja":3040},{"id":1413,"nomi":"Тойлоқ","reja":4375},{"id":1416,"nomi":"Самарқанд","reja":2135}],
    9 : [{"id":1909,"nomi":"Олтинсой","reja":4029},{"id":1901,"nomi":"Ангор","reja":5650},{"id":1902,"nomi":"Бандихон","reja":4988},{"id":1903,"nomi":"Бойсун","reja":100},{"id":1908,"nomi":"Денов","reja":9077},{"id":1904,"nomi":"Музробод","reja":11000},{"id":1905,"nomi":"Жарқўрғон","reja":8080},{"id":1907,"nomi":"Қумқўрғон","reja":8133},{"id":1906,"nomi":"Қизириқ","reja":9990},{"id":1910,"nomi":"Сариосиё","reja":2500},{"id":1911,"nomi":"Термиз","reja":2900},{"id":1912,"nomi":"Узун","reja":4458},{"id":1913,"nomi":"Шеробод","reja":12100},{"id":1914,"nomi":"Шўрчи","reja":6795}],
    10 : [{"id":1207,"nomi":"Сирдарё","reja":8850},{"id":1205,"nomi":"Оқолтин","reja":13500},{"id":1201,"nomi":"Боёвут","reja":12350},{"id":1206,"nomi":"Сайхунобод","reja":10850},{"id":1202,"nomi":"Гулистон","reja":7850},{"id":1209,"nomi":"Сардоба","reja":12300},{"id":1204,"nomi":"Мирзаобод","reja":3500},{"id":1208,"nomi":"Ховос","reja":9800}],
    11 : [{"id":1111,"nomi":"Тошкент","reja":1260},{"id":1107,"nomi":"Оққўрғон","reja":10600},{"id":1108,"nomi":"Охангарон","reja":4630},{"id":1101,"nomi":"Бекобод","reja":14800},{"id":1103,"nomi":"Бўстонлиқ","reja":500},{"id":1102,"nomi":"Бўка","reja":14800},{"id":1106,"nomi":"Қуйи чирчиқ","reja":13400},{"id":1104,"nomi":"Зангиота","reja":800},{"id":1114,"nomi":"Юқори чирчиқ","reja":7800},{"id":1105,"nomi":"Қибрай","reja":600},{"id":1109,"nomi":"Паркент","reja":0},{"id":1110,"nomi":"Пискент","reja":8655},{"id":1112,"nomi":"Ўрта чирчиқ","reja":10000},{"id":1113,"nomi":"Чиноз","reja":7800},{"id":1115,"nomi":"Янгийўл","reja":8200}],
    12 : [{"id":1505,"nomi":"Ёзёвон","reja":6840},{"id":1513,"nomi":"Фарғона","reja":6500},{"id":1506,"nomi":"Қува","reja":5595},{"id":1514,"nomi":"Фурқат","reja":6630},{"id":1511,"nomi":"Тошлоқ","reja":5175},{"id":1504,"nomi":"Данғара","reja":8670},{"id":1508,"nomi":"Қўштепа","reja":8310},{"id":1515,"nomi":"Ўзбекистонт","reja":5960},{"id":1501,"nomi":"Бағдод","reja":7860},{"id":1512,"nomi":"Учкўприк","reja":7040},{"id":1503,"nomi":"Бувайда","reja":7305},{"id":1509,"nomi":"Риштон","reja":7880},{"id":1507,"nomi":"Олтиариқ ","reja":5400},{"id":1510,"nomi":"Сўх","reja":700},{"id":1502,"nomi":"Бешариқ","reja":8885},{"id":1518,"nomi":"Қувасой ш","reja":250}],
    13 : [{"id":2202,"nomi":"Гурлан","reja":4200},{"id":2201,"nomi":"Боғот","reja":2500},{"id":2209,"nomi":"Қўшкўпир  ","reja":3700},{"id":0,"nomi":"Тупроққалъа","reja":1500},{"id":2210,"nomi":"Хазорасп","reja":3000},{"id":2205,"nomi":"Хива","reja":3000},{"id":2204,"nomi":"Хонқа","reja":3100},{"id":2206,"nomi":"Шовот","reja":4000},{"id":2207,"nomi":"Янгиариқ","reja":2000},{"id":2208,"nomi":"Янгибозор","reja":3100},{"id":2211,"nomi":"Урганч","reja":3100}],
    14 : "Тошкент шахар"
}


